content/programming/notes/fisica/02-dinamica.org
#+startup: content indent

[[file:../../../index.org][Giovanni's Diary]] > [[file:../../../subjects.org][Subjects]] > [[file:../../programming.org][Programming]] > [[file:../notes.org][Notes]] > [[file:fisica.org][Fisica]] >

* Dinamica
#+INDEX: Giovanni's Diary!Programming!Notes!Fisica!Dinamica


La dinamica si occupa dello studio delle forze.

** Statica

In statica, la risultante delle forze $\vec{R}$ e' pari a $0$.  Si
immagini un'oggetto su un piano in assenza di movimento. Il corpo e'
soggetto all forza peso, che deve essere annullata da un'altra forza
$N$ detta **reazione vincolare**.

$$ \vec{R} = \vec{F}_p + \vec{N} = 0 $$

Quando ci si sposta da una condizione di equilibrio, si può
generalizzare una certa **forza di richiamo**, anche detta **forza
elastica**:

$$F_{richiamo} = -k \Delta S$$

- viene direttamente dalla terza legge della dinamica, esprimendo
  l'accelerazione come la doppia derivata dello spazio.

** Leggi della dinamica

*** Prima legge della dinamica - Legge di inerzia

Un corpo permane nel suo stato di quiete e moto rettilineo uniforme
finché non intervenga un agente esterno.  Similmente, lo stato di moto
di un corpo non varia se non per l'azione di un agente esterno.

- un sistema in cui questo principio vale e' detto sistema inerziale

*** Seconda legge della dinamica - Legge di Newton
Ricordando che, per definizione:

$$ a =^{def} \lim_{\Delta t \to 0 } \frac{\Delta v}{\Delta t} $$

**In un sistema inerziale**, vale:

$$ F = ma $$

Più precisamente, per il principio di sovrapposizione, vale che la
forza risultante e':

$$ \vec{R}_c = \sum_{i = 0}^{N} \vec{F}_{i \rightarrow c} = m \sum_{i = 0}^{N} a_i = m \vec{a}_{tot} $$

attenzione: questi principi non si dimostrano, sono verità' della
natura (a differenza dei teoremi).

- Questa forza e' l'agente esterno di cui parla il primo principio.
- La sua unita' di misura e' $kgm/s^2$ o $N$ (Newton).

**** Excursus sulla massa

La massa della legge di newton e' detta massa inerziale. La massa
serve per bilanciare il rapporto tra la forza e l'accelerazione,
rappresenta la capacita' di un corpo di partecipare al moto. Questa e'
la sua ragion d'esistere.  In un corpo in caduta, vale che $\vec{F} =
m_{gravitazionale} \vec{a}$, da notare che qui si parla di massa
gravitazionale. In altri contesti questa variabile viene chiamata in
modo diverso (da vedere la sezione sulla legge di gravitazione
universale). Solo sperimentalmente vale che il valore e' uguale alla
massa inerziale, ma da un punto di vista puramente teorico e
concettuale questa uguaglianza non e' ovvia.

*** Terza legge della dinamica - Principio di Azione Reazione

$$ \vec{F}_{1->2} = - \vec{F}_{2->1} $$

Nota: non è vero che allora le accelerazioni sono opposte (lo
sarebbero solo con masse uguali).

- **Esempio**: Rinculo. Ad una forza al proiettile corrisponde la
  stessa forza sull'uomo che spara. Ma le accelerazioni sono diverse:
  il proiettile accelera molto mentre l'uomo meno.

** Quantità di moto e impulso
Definiamo la quantità' di moto $\vec{p}$ come:

$$\vec{p}=m\vec{v}$$
Definiamo impulso $\vec{J}$ come:

$$\vec{J} = \vec{p}_f - \vec{p}_i = \Delta \vec{p} = m \Delta \vec{v}$$

Allora:

$$\vec{F} = \frac{d\vec{p}}{dt}$$

questa ultima formula e' la forma più generale della legge di Newton.

** Moto del pendolo

Supponiamo di avere un filo sospeso da un soffitto con una massa
attaccata all'altra estremità'. Si assuma che valgano i seguenti
punti:

- il vincolo tra il filo e il soffitto non presenta attrito
- il filo e' inestensibile, puntiforme (non ha fattori geometrici che
  oppongono resistenza all'aria) e senza massa
- la massa si trova nel vuoto (assenza di aria)
- ci troviamo in un campo di forze uniforme (ad esempio, la forza peso
  e' la stessa in ogni punto)

*** Velocità angolare del pendolo
Osserviamo che il pendolo compie un moto circolare, dunque ha un'accelerazione normale $a_n = \frac{v^2}{R}$. Questa forza viene esercitata dal filo ed e' massima quando la velocità' e' massima e nulla quando la velocità' e' nulla (nel punto più' alto).

Vale:

$$ a_t = \frac{d\vec{v}}{dt} = \frac{d^2(S)}{dt^2} = \frac{d^2(L\theta)}{dt^2} =L\frac{d^2\theta}{dt^2} $$

Notiamo che l'accelerazione dipende da $\theta$. Considerando un
sistema di riferimento centrato della massa in movimento, con l'asse y
positivo verso l'alto e l'asse x positivo verso la direzione di
moto. Allora vale:

$$ a_t = g_{//} = -gsin(\theta) $$

Dunque, mettendoli a sistema:

$$ L\frac{d^2\theta}{dt^2} + gsin(\theta) = 0 $$

Anche scritta come:

$$\theta '' + \frac{g}{l}sin(\theta) = 0$$

Consideriamo ora una differenza di tempo infinitesimamente piccola (**ipotesi delle piccole oscillazioni**), possiamo applicare le serie di Taylor sul valore del seno, dunque:

$$ L\frac{d\theta^2}{dt^2}+g\theta = 0 $$
$$ L\frac{d\theta^2}{dt^2}+g\theta \frac{L}{L} = 0 $$
$$ \frac{d\theta^2}{dt^2}+\frac{g}{L} \theta = 0 $$

Osserviamo che questa si riconduce all'equazione differenziale del
moto armonico già vista in precedenza $\theta '' + \omega ^2 \theta
=0$. Allora, in senso fisico, per questo moto, definiamo:

$$ \omega^2 =^{def} \frac{g}{L}$$

Per $\omega = \frac{2\pi}{T}$, vale:

$$T = 2\pi \sqrt{\frac{L}{g}}$$

Notiamo che:

> Se gli angoli sono piccoli, il periodo non dipende dall'ampiezza
> dell'oscillazione

** Forza elastica

Si consideri una molla, ancorata ad una parete stabile da un lato e
con una massa dall'altro. Assumiamo non ci sia attrito, possiamo
osservare che la massa e' completamente irrilevante in assenza di
attrito.  Come nel moto del pendolo, possiamo arrivare all'equazione
fondamentale del moto armonico in questo modo:

$$ F= ma = m\frac{dv}{dt} = m\frac{dX^2}{dt^2} $$

E' un sistema lineare, possiamo dire che la forza e' proporzionale
alla differenza di spostamento. Chiamiamo la costante di
proporzionalità $k$:

$$ F_{richiamo\ all\ equilibrio} = -kX $$

Il meno viene dal sistema di riferimento, con lo 0 posto sulla massa
attaccata alla molla.

Mettendole a sistema otteniamo:

$$ m\frac{dX^2}{dt} +  kX = 0 $$
$$ \frac{dX^2}{dt} + \frac{k}{m}X = 0$$

Questa si rifa all'equazione armonica, ossia:

$$X+\omega ^2 x = 0$$

Che nel caso della molla vale, in senso fisico vale:

$$ \omega ^2 =^{def} \frac{k}{m} $$

Da $\omega = \frac{2\pi}{T}$ otteniamo:

$$ T = 2 \pi \sqrt{\frac{m}{k}} $$

