public/programming/notes/fisica/02-dinamica.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">

</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../notes.html">Notes</a> &gt; <a href="fisica.html">Fisica</a> &gt;
</p>

<div id="outline-container-org2742f23" class="outline-2">
<h2 id="org2742f23">Dinamica</h2>
<div class="outline-text-2" id="text-org2742f23">
<p>
La dinamica si occupa dello studio delle forze.
</p>
</div>

<div id="outline-container-org17e848e" class="outline-3">
<h3 id="org17e848e">Statica</h3>
<div class="outline-text-3" id="text-org17e848e">
<p>
In statica, la risultante delle forze \(\vec{R}\) e' pari a \(0\).  Si
immagini un'oggetto su un piano in assenza di movimento. Il corpo e'
soggetto all forza peso, che deve essere annullata da un'altra forza
\(N\) detta <b><b>reazione vincolare</b></b>.
</p>

<p>
\[ \vec{R} = \vec{F}_p + \vec{N} = 0 \]
</p>

<p>
Quando ci si sposta da una condizione di equilibrio, si può
generalizzare una certa <b><b>forza di richiamo</b></b>, anche detta <b><b>forza
elastica</b></b>:
</p>

<p>
\[F_{richiamo} = -k \Delta S\]
</p>

<ul class="org-ul">
<li>viene direttamente dalla terza legge della dinamica, esprimendo
l'accelerazione come la doppia derivata dello spazio.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc62f862" class="outline-3">
<h3 id="orgc62f862">Leggi della dinamica</h3>
<div class="outline-text-3" id="text-orgc62f862">
</div>
<div id="outline-container-org104d46e" class="outline-4">
<h4 id="org104d46e">Prima legge della dinamica - Legge di inerzia</h4>
<div class="outline-text-4" id="text-org104d46e">
<p>
Un corpo permane nel suo stato di quiete e moto rettilineo uniforme
finché non intervenga un agente esterno.  Similmente, lo stato di moto
di un corpo non varia se non per l'azione di un agente esterno.
</p>

<ul class="org-ul">
<li>un sistema in cui questo principio vale e' detto sistema inerziale</li>
</ul>
</div>
</div>

<div id="outline-container-orga5c5b19" class="outline-4">
<h4 id="orga5c5b19">Seconda legge della dinamica - Legge di Newton</h4>
<div class="outline-text-4" id="text-orga5c5b19">
<p>
Ricordando che, per definizione:
</p>

<p>
\[ a =^{def} \lim_{\Delta t \to 0 } \frac{\Delta v}{\Delta t} \]
</p>

<p>
<b><b>In un sistema inerziale</b></b>, vale:
</p>

<p>
\[ F = ma \]
</p>

<p>
Più precisamente, per il principio di sovrapposizione, vale che la
forza risultante e':
</p>

<p>
\[ \vec{R}_c = \sum_{i = 0}^{N} \vec{F}_{i \rightarrow c} = m \sum_{i = 0}^{N} a_i = m \vec{a}_{tot} \]
</p>

<p>
attenzione: questi principi non si dimostrano, sono verità' della
natura (a differenza dei teoremi).
</p>

<ul class="org-ul">
<li>Questa forza e' l'agente esterno di cui parla il primo principio.</li>
<li>La sua unita' di misura e' \(kgm/s^2\) o \(N\) (Newton).</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org9b94090"></a>Excursus sulla massa<br />
<div class="outline-text-5" id="text-org9b94090">
<p>
La massa della legge di newton e' detta massa inerziale. La massa
serve per bilanciare il rapporto tra la forza e l'accelerazione,
rappresenta la capacita' di un corpo di partecipare al moto. Questa e'
la sua ragion d'esistere.  In un corpo in caduta, vale che \(\vec{F} =
m_{gravitazionale} \vec{a}\), da notare che qui si parla di massa
gravitazionale. In altri contesti questa variabile viene chiamata in
modo diverso (da vedere la sezione sulla legge di gravitazione
universale). Solo sperimentalmente vale che il valore e' uguale alla
massa inerziale, ma da un punto di vista puramente teorico e
concettuale questa uguaglianza non e' ovvia.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org604df44" class="outline-4">
<h4 id="org604df44">Terza legge della dinamica - Principio di Azione Reazione</h4>
<div class="outline-text-4" id="text-org604df44">
<p>
\[ \vec{F}_{1->2} = - \vec{F}_{2->1} \]
</p>

<p>
Nota: non è vero che allora le accelerazioni sono opposte (lo
sarebbero solo con masse uguali).
</p>

<ul class="org-ul">
<li><b><b>Esempio</b></b>: Rinculo. Ad una forza al proiettile corrisponde la
stessa forza sull'uomo che spara. Ma le accelerazioni sono diverse:
il proiettile accelera molto mentre l'uomo meno.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6654e2b" class="outline-3">
<h3 id="org6654e2b">Quantità di moto e impulso</h3>
<div class="outline-text-3" id="text-org6654e2b">
<p>
Definiamo la quantità' di moto \(\vec{p}\) come:
</p>

<p>
\[\vec{p}=m\vec{v}\]
Definiamo impulso \(\vec{J}\) come:
</p>

<p>
\[\vec{J} = \vec{p}_f - \vec{p}_i = \Delta \vec{p} = m \Delta \vec{v}\]
</p>

<p>
Allora:
</p>

<p>
\[\vec{F} = \frac{d\vec{p}}{dt}\]
</p>

<p>
questa ultima formula e' la forma più generale della legge di Newton.
</p>
</div>
</div>

<div id="outline-container-orge481151" class="outline-3">
<h3 id="orge481151">Moto del pendolo</h3>
<div class="outline-text-3" id="text-orge481151">
<p>
Supponiamo di avere un filo sospeso da un soffitto con una massa
attaccata all'altra estremità'. Si assuma che valgano i seguenti
punti:
</p>

<ul class="org-ul">
<li>il vincolo tra il filo e il soffitto non presenta attrito</li>
<li>il filo e' inestensibile, puntiforme (non ha fattori geometrici che
oppongono resistenza all'aria) e senza massa</li>
<li>la massa si trova nel vuoto (assenza di aria)</li>
<li>ci troviamo in un campo di forze uniforme (ad esempio, la forza peso
e' la stessa in ogni punto)</li>
</ul>
</div>

<div id="outline-container-org79b2841" class="outline-4">
<h4 id="org79b2841">Velocità angolare del pendolo</h4>
<div class="outline-text-4" id="text-org79b2841">
<p>
Osserviamo che il pendolo compie un moto circolare, dunque ha un'accelerazione normale \(a_n = \frac{v^2}{R}\). Questa forza viene esercitata dal filo ed e' massima quando la velocità' e' massima e nulla quando la velocità' e' nulla (nel punto più' alto).
</p>

<p>
Vale:
</p>

<p>
\[ a_t = \frac{d\vec{v}}{dt} = \frac{d^2(S)}{dt^2} = \frac{d^2(L\theta)}{dt^2} =L\frac{d^2\theta}{dt^2} \]
</p>

<p>
Notiamo che l'accelerazione dipende da \(\theta\). Considerando un
sistema di riferimento centrato della massa in movimento, con l'asse y
positivo verso l'alto e l'asse x positivo verso la direzione di
moto. Allora vale:
</p>

<p>
\[ a_t = g_{//} = -gsin(\theta) \]
</p>

<p>
Dunque, mettendoli a sistema:
</p>

<p>
\[ L\frac{d^2\theta}{dt^2} + gsin(\theta) = 0 \]
</p>

<p>
Anche scritta come:
</p>

<p>
\[\theta '' + \frac{g}{l}sin(\theta) = 0\]
</p>

<p>
Consideriamo ora una differenza di tempo infinitesimamente piccola (<b><b>ipotesi delle piccole oscillazioni</b></b>), possiamo applicare le serie di Taylor sul valore del seno, dunque:
</p>

<p>
\[ L\frac{d\theta^2}{dt^2}+g\theta = 0 \]
\[ L\frac{d\theta^2}{dt^2}+g\theta \frac{L}{L} = 0 \]
\[ \frac{d\theta^2}{dt^2}+\frac{g}{L} \theta = 0 \]
</p>

<p>
Osserviamo che questa si riconduce all'equazione differenziale del
moto armonico già vista in precedenza \(\theta '' + \omega ^2 \theta
=0\). Allora, in senso fisico, per questo moto, definiamo:
</p>

<p>
\[ \omega^2 =^{def} \frac{g}{L}\]
</p>

<p>
Per \(\omega = \frac{2\pi}{T}\), vale:
</p>

<p>
\[T = 2\pi \sqrt{\frac{L}{g}}\]
</p>

<p>
Notiamo che:
</p>

<p>
&gt; Se gli angoli sono piccoli, il periodo non dipende dall'ampiezza
&gt; dell'oscillazione
</p>
</div>
</div>
</div>

<div id="outline-container-orga1cc08f" class="outline-3">
<h3 id="orga1cc08f">Forza elastica</h3>
<div class="outline-text-3" id="text-orga1cc08f">
<p>
Si consideri una molla, ancorata ad una parete stabile da un lato e
con una massa dall'altro. Assumiamo non ci sia attrito, possiamo
osservare che la massa e' completamente irrilevante in assenza di
attrito.  Come nel moto del pendolo, possiamo arrivare all'equazione
fondamentale del moto armonico in questo modo:
</p>

<p>
\[ F= ma = m\frac{dv}{dt} = m\frac{dX^2}{dt^2} \]
</p>

<p>
E' un sistema lineare, possiamo dire che la forza e' proporzionale
alla differenza di spostamento. Chiamiamo la costante di
proporzionalità \(k\):
</p>

<p>
\[ F_{richiamo\ all\ equilibrio} = -kX \]
</p>

<p>
Il meno viene dal sistema di riferimento, con lo 0 posto sulla massa
attaccata alla molla.
</p>

<p>
Mettendole a sistema otteniamo:
</p>

<p>
\[ m\frac{dX^2}{dt} +  kX = 0 \]
\[ \frac{dX^2}{dt} + \frac{k}{m}X = 0\]
</p>

<p>
Questa si rifa all'equazione armonica, ossia:
</p>

<p>
\[X+\omega ^2 x = 0\]
</p>

<p>
Che nel caso della molla vale, in senso fisico vale:
</p>

<p>
\[ \omega ^2 =^{def} \frac{k}{m} \]
</p>

<p>
Da \(\omega = \frac{2\pi}{T}\) otteniamo:
</p>

<p>
\[ T = 2 \pi \sqrt{\frac{m}{k}} \]
</p>
</div>
</div>
