content/programming/notes/fisica/02-dinamica.org
** Attrito
L'attrito e' un fenomeno che dissipa energia in modo
**irreversibile**. Tutti i macro oggetti hanno attrito (ecco perché
non esistono macchine di movimento perpetuo).

$$ \vec{F_A} = \mu |\vec{N}| \hat a $$

Dove N è la forza normale o reazione vincolare, a è il versore che da
la direzione **tangente allo spostamento**. Dall'analisi dimensionale
vediamo che $\mu$ e' un numero puro.

*** Caso statica

$$ \vec{F_{as}} = -\vec{F_{applicata}} $$
$$ |\vec{F_{as}^{max}}| = \mu_{statico} |\vec{N}| $$

*** Caso dinamica

$$ |\vec{F_{ad}}| = -\mu_{dinamico}|\vec{N}|\hat{v} $$

** Legge di gravitazione universale

La forza gravitazionale tra due masse a distanza r vale:

$$ \vec{F}_G = - G \frac{m_{G_1} m_{G_2}}{\vec{r}^2_{1-2}} \hat{r}_{1-2} $$

Dove $\hat r$ è il versore della **congiungente** tra le due masse.
La natura della massa nel secondo principio della dinamica rispetto
all forza gravitazionale è fondamentalmente diversa. Nella seconda, la
massa è una certa carica, una certa disponibilità, una qualità del
corpo nel partecipare alla forza di gravitazione.  Ci accorgiamo che
questa formula è una "template" della natura, infatti:

$$ \vec{F}_{coulomb} = G_{elet} \frac{q_1 q_2}{\vec{r}_{1-2}^2}\hat{r}_{1-2}$$

*** Forza di gravita' sulla terra

Torniamo sulla forza gravitazionale, usando le prime due equazioni nei
corpi C (corpo) e T (terra):

$$ m_{I_C}\vec{a} = -G\frac{m_{G_C} m_{G_T}}{\vec{r}_{ct}^2}\hat{r}_{ct} $$
semplificando togliendo il verso:

$$ m_{I_C}a = G\frac{m_{G_C} m_{G_T}}{\vec{r}_{ct}^2} $$

Possiamo poi approssimare nel seguente modo:
$$ r_{CT} = R_T + h = R(1+\frac{h}{R_T})$$
$$ r_{CT}^2 \approx R_T^2(1+2\frac{h}{R_T}) $$

ho sviluppato il quadrato e ho trascurato l'ultimo termine perché è di
un'ordine di grandezza molto piccolo:

$$ \frac{1}{r_{CT}^2} = \frac{1}{R_{CT}^2}(1-2\frac{h}{R_T}) \approx \frac{1}{R^2_{CT}} $$

Allora:

$$ a = \frac{m_{Gc}}{m_{Ic}}G\frac{m_{G_T}}{R_T^2} $$
Per noi che siamo ignoranti e non dei fisici veri, $m_g = m_i$, dunque:

$$ a = g = G\frac{m_{G_T}}{R_T^2} $$
$$ G = 6.67 \cdot 10^{-11} \frac{Nm^2}{Kg^2} $$
$$ R_T = 6.74\cdot 10^6 m $$

Interessante il discorso filosofico tra la massa gravitazionale e la
massa inerziale, che non sono le stesse ma in esperimento lo sono.  La
forza di gravitazione e' una delle quattro **forze fondamentali**, che
non dipendono da altre e dunque sono leggi della natura. Qui il prof
si masturba con idee filosofiche ed estetiche.

** Centro di massa

Definizione del **centro di massa** come media pesata dei punti nello
spazio in base alla massa:

$$\vec{X}_{CM} = \sum_{i=1}^N \frac{m_i}{M_{TOT}}\vec{x}_i$$

in modo simile, esiste la velocità nel centro di massa e
l'accelerazione.

Dimostrazione:
Sia $\vec{R}$ l'insieme di tutte le forze che agiscono nel sistema:

$$ \vec{R}_i = m_i \vec{a}_i  $$
$$ \vec{R} = \sum_{i = 1}^{N} \vec{R}_i $$

Dividiamo le forze del sistema in due famiglie:

- forze interne
- forze esterne

$$ \vec{R}_i =  \vec{R}_i^{Esterne} + \vec{R}_i^{Interne} $$
$$ \vec{R}^{Esterne} = \sum_{k=1}^{M} \vec{R}_i^{Esterne} =^{def} \sum_{i=1}^{N} \sum_{k=1}^{M} \vec{F}_{k \rightarrow i}^{Esterne} $$
$$ \vec{R}^{Interne} = \sum_{j=1, i \ne j}^{N} \vec{R}_i^{Interne} =^{def} \sum_{i=1}^{N} \sum_{j=1, i \ne j}^{N} \vec{F}_{j \rightarrow i}^{Interne} = 0 $$

Le forze interne, sommate, si annullano a vicenda (per la terza legge
della dinamica). Dunque:

$$ \vec{R} = \vec{R}^{Interne} + \vec{R}^{Esterne} = \sum_{i=1}^{N} \vec{R}_i^{Esterne} = \sum_{i=1}^{N} m_i \vec{a}_i $$
$$ = \sum_{i=1}^{N} m_i \frac{d^2 \vec{X}_i}{dt^2} = \frac{d^2}{dt^2}[\sum_{i=1}^{N}m_i \vec{x}_i] $$

Definiamo il **centro di massa** come:

$$ \vec{X}_{C.M.} =^{def}  \frac{\sum_{i=1}^{N} m_i \vec{x}_i}{\sum_{i=1}^{N} m_i} = \sum_{i=1}^{N} \frac{m_i}{M}\vec{x}_i $$

- $M$ è la massa del sistema (somma di tutte le masse)
- in altre parole, la somma di masse per la distanze, diviso la somma
  delle masse
- sapendo la X del centro di massa, possiamo trovare la velocità e
  l'accelerazione semplicemente derivando:

$$ \vec{R}^{Esterne} = M\frac{d^2 \vec{X}_{cm}}{dt^2} = M \vec{a}_{cm} $$

- In un sistema isolato, le forze esterne sono nulle:

$$ \vec{R}^{Esterne} = 0 $$

Dunque l'accelerazione è 0, e la velocità è costante. Concludiamo che la quantità di moto si conserva.
$$ \vec{p}_{cm} = \vec{cost} $$

** Il sistema di riferimento

Anzitutto, assumiamo:

- nessuna rotazione dell'oggetto, solo translazioni
- nessuna rotazione dei sistema di riferimento

Un punto può essere rappresentato come un raggio-vettore che parte da un certo sistema di riferimento. Siano $O$ e $O'$ due sistemi di riferimento, possiamo descrivere il punto $P$ come il vettore $r$ e $r'$. Ci interessano le equazioni per esprimere le leggi da un sistema all'altro. 
Se i due sistemi sono fermi tra loro, posso definirmi il vettore $\vec{OO'}$. Allora vale (per la regola del parallelogramma):

$$ \vec{r} = \vec{OO'} +\vec{r'} $$

Se derivo l'equazione assumendo la distanza tra $O$ e $O'$ costante:

$$ \vec{v} = 0 + \vec{v'} $$

Chiamerò questa velocità come la **velocità di trascinamento**. Attenzione alla differenza tra le notazioni.

$$ \vec{v}_A \ne \vec{v}_{A'} \ne \vec{v}_A' $$

Se invece la distanza tra i sistemi di riferimento è variabile:

$$ \vec{v} = \vec{v}_{O'} + \vec{v'} $$
$$ \vec{a} = \vec{a}_{O'} + \vec{a'} $$

Consideriamo il sistema come isolato e centrato nel centro di massa:

$$ \vec{r} = \vec{r}_{cm} + \vec{r}_{sistema\ cm} $$
$$ \vec{p}_{cm} = \vec{cons} $$

Dunque la quantità di moto si conserva, anche se non è un sistema
inerziale.  Supponiamo di avere un sistema di riferimento *S* che
viaggia in moto rettilineo uniforme con velocità v e un sistema S' che
si muove in m. r. u. e con velocità v' Dalle formule precedenti, vale:

$$ \vec{v}' = \vec{v} - \vec{v}_{o'} $$

Questi sono sistemi di riferimento inerziali collegati, detta **classe
di sistemi di riferimento inerziali** dove vale:

** Principio di Relatività Galileiana

$$ \vec{x} = \vec{x}' + \vec{OO'} $$
$$ \vec{v} = \vec{v}' + \vec{v}_{o'} $$

Questo principio mostra che le leggi della fisica funzionano in equal
modo in un **sistema di riferimento inerziale**. Non esiste un sistema
di riferimento giusto o sbagliato, sono tutti equivalenti.
- esempio del naviglio: non posso rendermi conto se dentro una nave
  sono fermo o mi sto muovendo con una certa velocità costante

