public/programming/notes/fisica/02-dinamica.html

<div id="outline-container-orga865b7a" class="outline-3">
<h3 id="orga865b7a">Attrito</h3>
<div class="outline-text-3" id="text-orga865b7a">
<p>
L'attrito e' un fenomeno che dissipa energia in modo
<b><b>irreversibile</b></b>. Tutti i macro oggetti hanno attrito (ecco perché
non esistono macchine di movimento perpetuo).
</p>

<p>
\[ \vec{F_A} = \mu |\vec{N}| \hat a \]
</p>

<p>
Dove N è la forza normale o reazione vincolare, a è il versore che da
la direzione <b><b>tangente allo spostamento</b></b>. Dall'analisi dimensionale
vediamo che \(\mu\) e' un numero puro.
</p>
</div>

<div id="outline-container-orgaa3e04d" class="outline-4">
<h4 id="orgaa3e04d">Caso statica</h4>
<div class="outline-text-4" id="text-orgaa3e04d">
<p>
\[ \vec{F_{as}} = -\vec{F_{applicata}} \]
\[ |\vec{F_{as}^{max}}| = \mu_{statico} |\vec{N}| \]
</p>
</div>
</div>

<div id="outline-container-orgb251c03" class="outline-4">
<h4 id="orgb251c03">Caso dinamica</h4>
<div class="outline-text-4" id="text-orgb251c03">
<p>
\[ |\vec{F_{ad}}| = -\mu_{dinamico}|\vec{N}|\hat{v} \]
</p>
</div>
</div>
</div>

<div id="outline-container-org12aa86c" class="outline-3">
<h3 id="org12aa86c">Legge di gravitazione universale</h3>
<div class="outline-text-3" id="text-org12aa86c">
<p>
La forza gravitazionale tra due masse a distanza r vale:
</p>

<p>
\[ \vec{F}_G = - G \frac{m_{G_1} m_{G_2}}{\vec{r}^2_{1-2}} \hat{r}_{1-2} \]
</p>

<p>
Dove \(\hat r\) è il versore della <b><b>congiungente</b></b> tra le due masse.
La natura della massa nel secondo principio della dinamica rispetto
all forza gravitazionale è fondamentalmente diversa. Nella seconda, la
massa è una certa carica, una certa disponibilità, una qualità del
corpo nel partecipare alla forza di gravitazione.  Ci accorgiamo che
questa formula è una "template" della natura, infatti:
</p>

<p>
\[ \vec{F}_{coulomb} = G_{elet} \frac{q_1 q_2}{\vec{r}_{1-2}^2}\hat{r}_{1-2}\]
</p>
</div>

<div id="outline-container-org085443d" class="outline-4">
<h4 id="org085443d">Forza di gravita' sulla terra</h4>
<div class="outline-text-4" id="text-org085443d">
<p>
Torniamo sulla forza gravitazionale, usando le prime due equazioni nei
corpi C (corpo) e T (terra):
</p>

<p>
\[ m_{I_C}\vec{a} = -G\frac{m_{G_C} m_{G_T}}{\vec{r}_{ct}^2}\hat{r}_{ct} \]
semplificando togliendo il verso:
</p>

<p>
\[ m_{I_C}a = G\frac{m_{G_C} m_{G_T}}{\vec{r}_{ct}^2} \]
</p>

<p>
Possiamo poi approssimare nel seguente modo:
\[ r_{CT} = R_T + h = R(1+\frac{h}{R_T})\]
\[ r_{CT}^2 \approx R_T^2(1+2\frac{h}{R_T}) \]
</p>

<p>
ho sviluppato il quadrato e ho trascurato l'ultimo termine perché è di
un'ordine di grandezza molto piccolo:
</p>

<p>
\[ \frac{1}{r_{CT}^2} = \frac{1}{R_{CT}^2}(1-2\frac{h}{R_T}) \approx \frac{1}{R^2_{CT}} \]
</p>

<p>
Allora:
</p>

<p>
\[ a = \frac{m_{Gc}}{m_{Ic}}G\frac{m_{G_T}}{R_T^2} \]
Per noi che siamo ignoranti e non dei fisici veri, \(m_g = m_i\), dunque:
</p>

<p>
\[ a = g = G\frac{m_{G_T}}{R_T^2} \]
\[ G = 6.67 \cdot 10^{-11} \frac{Nm^2}{Kg^2} \]
\[ R_T = 6.74\cdot 10^6 m \]
</p>

<p>
Interessante il discorso filosofico tra la massa gravitazionale e la
massa inerziale, che non sono le stesse ma in esperimento lo sono.  La
forza di gravitazione e' una delle quattro <b><b>forze fondamentali</b></b>, che
non dipendono da altre e dunque sono leggi della natura. Qui il prof
si masturba con idee filosofiche ed estetiche.
</p>
</div>
</div>
</div>

<div id="outline-container-org3fd391f" class="outline-3">
<h3 id="org3fd391f">Centro di massa</h3>
<div class="outline-text-3" id="text-org3fd391f">
<p>
Definizione del <b><b>centro di massa</b></b> come media pesata dei punti nello
spazio in base alla massa:
</p>

<p>
\[\vec{X}_{CM} = \sum_{i=1}^N \frac{m_i}{M_{TOT}}\vec{x}_i\]
</p>

<p>
in modo simile, esiste la velocità nel centro di massa e
l'accelerazione.
</p>

<p>
Dimostrazione:
Sia \(\vec{R}\) l'insieme di tutte le forze che agiscono nel sistema:
</p>

<p>
\[ \vec{R}_i = m_i \vec{a}_i  \]
\[ \vec{R} = \sum_{i = 1}^{N} \vec{R}_i \]
</p>

<p>
Dividiamo le forze del sistema in due famiglie:
</p>

<ul class="org-ul">
<li>forze interne</li>
<li>forze esterne</li>
</ul>

<p>
\[ \vec{R}_i =  \vec{R}_i^{Esterne} + \vec{R}_i^{Interne} \]
\[ \vec{R}^{Esterne} = \sum_{k=1}^{M} \vec{R}_i^{Esterne} =^{def} \sum_{i=1}^{N} \sum_{k=1}^{M} \vec{F}_{k \rightarrow i}^{Esterne} \]
\[ \vec{R}^{Interne} = \sum_{j=1, i \ne j}^{N} \vec{R}_i^{Interne} =^{def} \sum_{i=1}^{N} \sum_{j=1, i \ne j}^{N} \vec{F}_{j \rightarrow i}^{Interne} = 0 \]
</p>

<p>
Le forze interne, sommate, si annullano a vicenda (per la terza legge
della dinamica). Dunque:
</p>

<p>
\[ \vec{R} = \vec{R}^{Interne} + \vec{R}^{Esterne} = \sum_{i=1}^{N} \vec{R}_i^{Esterne} = \sum_{i=1}^{N} m_i \vec{a}_i \]
\[ = \sum_{i=1}^{N} m_i \frac{d^2 \vec{X}_i}{dt^2} = \frac{d^2}{dt^2}[\sum_{i=1}^{N}m_i \vec{x}_i] \]
</p>

<p>
Definiamo il <b><b>centro di massa</b></b> come:
</p>

<p>
\[ \vec{X}_{C.M.} =^{def}  \frac{\sum_{i=1}^{N} m_i \vec{x}_i}{\sum_{i=1}^{N} m_i} = \sum_{i=1}^{N} \frac{m_i}{M}\vec{x}_i \]
</p>

<ul class="org-ul">
<li>\(M\) è la massa del sistema (somma di tutte le masse)</li>
<li>in altre parole, la somma di masse per la distanze, diviso la somma
delle masse</li>
<li>sapendo la X del centro di massa, possiamo trovare la velocità e
l'accelerazione semplicemente derivando:</li>
</ul>

<p>
\[ \vec{R}^{Esterne} = M\frac{d^2 \vec{X}_{cm}}{dt^2} = M \vec{a}_{cm} \]
</p>

<ul class="org-ul">
<li>In un sistema isolato, le forze esterne sono nulle:</li>
</ul>

<p>
\[ \vec{R}^{Esterne} = 0 \]
</p>

<p>
Dunque l'accelerazione è 0, e la velocità è costante. Concludiamo che la quantità di moto si conserva.
\[ \vec{p}_{cm} = \vec{cost} \]
</p>
</div>
</div>

<div id="outline-container-orgf65f9bc" class="outline-3">
<h3 id="orgf65f9bc">Il sistema di riferimento</h3>
<div class="outline-text-3" id="text-orgf65f9bc">
<p>
Anzitutto, assumiamo:
</p>

<ul class="org-ul">
<li>nessuna rotazione dell'oggetto, solo translazioni</li>
<li>nessuna rotazione dei sistema di riferimento</li>
</ul>

<p>
Un punto può essere rappresentato come un raggio-vettore che parte da un certo sistema di riferimento. Siano \(O\) e \(O'\) due sistemi di riferimento, possiamo descrivere il punto \(P\) come il vettore \(r\) e \(r'\). Ci interessano le equazioni per esprimere le leggi da un sistema all'altro. 
Se i due sistemi sono fermi tra loro, posso definirmi il vettore \(\vec{OO'}\). Allora vale (per la regola del parallelogramma):
</p>

<p>
\[ \vec{r} = \vec{OO'} +\vec{r'} \]
</p>

<p>
Se derivo l'equazione assumendo la distanza tra \(O\) e \(O'\) costante:
</p>

<p>
\[ \vec{v} = 0 + \vec{v'} \]
</p>

<p>
Chiamerò questa velocità come la <b><b>velocità di trascinamento</b></b>. Attenzione alla differenza tra le notazioni.
</p>

<p>
\[ \vec{v}_A \ne \vec{v}_{A'} \ne \vec{v}_A' \]
</p>

<p>
Se invece la distanza tra i sistemi di riferimento è variabile:
</p>

<p>
\[ \vec{v} = \vec{v}_{O'} + \vec{v'} \]
\[ \vec{a} = \vec{a}_{O'} + \vec{a'} \]
</p>

<p>
Consideriamo il sistema come isolato e centrato nel centro di massa:
</p>

<p>
\[ \vec{r} = \vec{r}_{cm} + \vec{r}_{sistema\ cm} \]
\[ \vec{p}_{cm} = \vec{cons} \]
</p>

<p>
Dunque la quantità di moto si conserva, anche se non è un sistema
inerziale.  Supponiamo di avere un sistema di riferimento <b>S</b> che
viaggia in moto rettilineo uniforme con velocità v e un sistema S' che
si muove in m. r. u. e con velocità v' Dalle formule precedenti, vale:
</p>

<p>
\[ \vec{v}' = \vec{v} - \vec{v}_{o'} \]
</p>

<p>
Questi sono sistemi di riferimento inerziali collegati, detta <b><b>classe
di sistemi di riferimento inerziali</b></b> dove vale:
</p>
</div>
</div>

<div id="outline-container-org7d75688" class="outline-3">
<h3 id="org7d75688">Principio di Relatività Galileiana</h3>
<div class="outline-text-3" id="text-org7d75688">
<p>
\[ \vec{x} = \vec{x}' + \vec{OO'} \]
\[ \vec{v} = \vec{v}' + \vec{v}_{o'} \]
</p>

<p>
Questo principio mostra che le leggi della fisica funzionano in equal
modo in un <b><b>sistema di riferimento inerziale</b></b>. Non esiste un sistema
di riferimento giusto o sbagliato, sono tutti equivalenti.
</p>
<ul class="org-ul">
<li>esempio del naviglio: non posso rendermi conto se dentro una nave
sono fermo o mi sto muovendo con una certa velocità costante</li>
</ul>
</div>
</div>
