content/programming/notes/fisica/02-dinamica.org
** Forze esterne ed apparenti

Se esco da un sistema di riferimento inerziale, cambiano le leggi
della dinamica. Se io guardo un giubbotto e corro, o sono fermo, mi
appare che il giubbotto abbia una certa accelerazione. Per
un'accelerazione c'è bisogno di una forza ma il giubbotto è
fermo. Dobbiamo distinguere due tipi di forze: quelle **esterne** e
quelle **apparenti**

$$ \vec{F} = m\vec{a} \rightarrow^{S\rightarrow S'} \vec{F} = m(\vec{a}' + \vec{a}_{o'}) $$
$$ \vec{F} = m\vec{a}' + m\vec{a}_{o'} $$
$$ \vec{F}_{ext} + \vec{F}_{app} = m\vec{a}' $$

Questa è la formula generale della seconda legge della dinamica,
valida anche per i sistemi di riferimento non inerziali.

> Esistono forze apparenti se esiste un'accelerazione tra i sistemi di
> riferimento

Ogni forza **esterna** si può ricondurre a una delle 4 forze della natura

- **Forza gravitazionale**: la meno intenza di tutte, la prima ad
  essere stata scoperta
- **Forza elettromagnetica**
- **Forza debole:** responsabile del decadimento nucleare
- **Forza forte / nucleare**: tiene insieme la materia

Invece le forze apparenti sono effetto dell'accelerazione
dell'osservatore.

-----

Travel: [[file:fisica.org][Fisica]], [[file:../../../theindex.org][Index]]
