public/programming/notes/fisica/02-dinamica.html

<div id="outline-container-org9db5d8b" class="outline-3">
<h3 id="org9db5d8b">Forze esterne ed apparenti</h3>
<div class="outline-text-3" id="text-org9db5d8b">
<p>
Se esco da un sistema di riferimento inerziale, cambiano le leggi
della dinamica. Se io guardo un giubbotto e corro, o sono fermo, mi
appare che il giubbotto abbia una certa accelerazione. Per
un'accelerazione c'è bisogno di una forza ma il giubbotto è
fermo. Dobbiamo distinguere due tipi di forze: quelle <b><b>esterne</b></b> e
quelle <b><b>apparenti</b></b>
</p>

<p>
\[ \vec{F} = m\vec{a} \rightarrow^{S\rightarrow S'} \vec{F} = m(\vec{a}' + \vec{a}_{o'}) \]
\[ \vec{F} = m\vec{a}' + m\vec{a}_{o'} \]
\[ \vec{F}_{ext} + \vec{F}_{app} = m\vec{a}' \]
</p>

<p>
Questa è la formula generale della seconda legge della dinamica,
valida anche per i sistemi di riferimento non inerziali.
</p>

<p>
&gt; Esistono forze apparenti se esiste un'accelerazione tra i sistemi di
&gt; riferimento
</p>

<p>
Ogni forza <b><b>esterna</b></b> si può ricondurre a una delle 4 forze della natura
</p>

<ul class="org-ul">
<li><b><b>Forza gravitazionale</b></b>: la meno intenza di tutte, la prima ad
essere stata scoperta</li>
<li><b><b>Forza elettromagnetica</b></b></li>
<li><b><b>Forza debole:</b></b> responsabile del decadimento nucleare</li>
<li><b><b>Forza forte / nucleare</b></b>: tiene insieme la materia</li>
</ul>

<p>
Invece le forze apparenti sono effetto dell'accelerazione
dell'osservatore.
</p>

<hr />

<p>
Travel: <a href="fisica.html">Fisica</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
